# -*- coding: utf-8 -*-

# Задание 1
print("Привет мир!")

# Задание 2
print("Привет, программист!")
print(2 + 2)
print(10 / 3)

# Создайте в редакторе файл hello.py, в котором будет\
# переменная name с вашим именем
name = 'Andrey'
# Сделайте так, чтобы при запуске скрипта значение\
# переменной выводилось на экран
print(name)
